app/controllers/dishes_controller.rb

SELECT * FROM `dishes`
---
  def index
    @dishes = Dish.all

SELECT * FROM `dishes` WHERE (`dishes`.`id` = 1)
---
  def show
    @dish = Dish.find(params[:id])

INSERT INTO `dishes` (`name`, `updated_at`, `leftovers`, `user_id`, `created_at`) VALUES('Spaghetti casserole', '2010-07-15 03:41:08', 3, NULL, '2010-07-15 03:41:08')
---
  def create
    @dish = Dish.new(params[:dish])

    respond_to do |format|
      if @dish.save